In [2]:
import pandas as pd

In [7]:
df_glass = pd.read_csv('glass.csv')

In [14]:
print(df_glass)

     id_number       RI     Na    Mg    Al     Si     K    Ca    Ba   Fe  Type
0            1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0     1
1            2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.0     1
2            3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0     1
3            4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.00  0.0     1
4            5  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0     1
..         ...      ...    ...   ...   ...    ...   ...   ...   ...  ...   ...
209        210  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0     7
210        211  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0     7
211        212  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.0     7
212        213  1.51651  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.0     7
213        214  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0     7

[214 rows x 11 columns]

In [23]:
#print 1st 5 rows
df_glass.head(5)

   id_number       RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Type
0          1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0     1
1          2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0     1
2          3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0     1
3          4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0     1
4          5  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0     1

In [24]:
#print last 5 rows
df_glass.tail(5)

     id_number       RI     Na   Mg    Al     Si     K    Ca    Ba   Fe  Type
209        210  1.51623  14.14  0.0  2.88  72.61  0.08  9.18  1.06  0.0     7
210        211  1.51685  14.92  0.0  1.99  73.06  0.00  8.40  1.59  0.0     7
211        212  1.52065  14.36  0.0  2.02  73.42  0.00  8.44  1.64  0.0     7
212        213  1.51651  14.38  0.0  1.94  73.61  0.00  8.48  1.57  0.0     7
213        214  1.51711  14.23  0.0  2.08  73.36  0.00  8.62  1.67  0.0     7

In [28]:
#print all columns in the dataset
df_glass.columns

Index(['id_number', 'RI', 'Na', 'Mg', 'Al', 'Si', 'K', 'Ca', 'Ba', 'Fe',
       'Type'],
      dtype='object')

In [38]:
#store all values in 'Na' column in a variable as list
sodium = df_glass['Na']
print(sodium)

0      13.64
1      13.89
2      13.53
3      13.21
4      13.27
       ...
209    14.14
210    14.92
211    14.36
212    14.38
213    14.23
Name: Na, Length: 214, dtype: float64

In [67]:
#check RI column for nulls
if len(df_glass.RI[df_glass.RI.isnull()]) > 0:
    print("RI has nulls")
else:
    print("RI has no nulls")

RI has no nulls

In [64]:
#check for 0 in 'Ba' column
if 0 in df_glass['Ba']:
    print("Ba has 0")
else:
    print("Ba has no 0")

Ba has 0

In [79]:
#replace 0's with 9999
df_glass['Ba'].replace(0, 9999)

0      9999.00
1      9999.00
2      9999.00
3      9999.00
4      9999.00
        ...
209       1.06
210       1.59
211       1.64
212       1.57
213       1.67
Name: Ba, Length: 214, dtype: float64

In [77]:
df_glass.head()

   id_number       RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Type
0          1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0     1
1          2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0     1
2          3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0     1
3          4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0     1
4          5  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0     1

In [80]:
#save to new file
df_glass.to_csv("glass_new.csv")